Revit 2027 API
FirstNumberFormattingOptions Enumeration
 Defines the formatting options for the start of a sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FirstNumberFormattingOptions
Public Enumeration FirstNumberFormattingOptions
public enum class FirstNumberFormattingOptions
type FirstNumberFormattingOptions
Members
Member name | Value | Description
HideAndDecrement | 1 |  Hide the first number and decrease the remaining numbers by one.
HideWhenSingle | 2 |  Hide the first number only if there is a single number in the sequence.
ShowAll | 0 |  Display all numbers in the sequence.
See Also
Reference
Autodesk.Revit.DB Namespace